lab06-webservices/TestEquationService/xml-resources/web-service-references/EquationService/wsdl/localhost_8080/EquationService/EquationService.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.2.0-1 (tags/2.2.0u1-7139; 2012-06-02T10:55:19+0000) JAXWS-RI/2.2.6-2 JAXWS/2.2 svn-revision#unknown. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.2.0-1 (tags/2.2.0u1-7139; 2012-06-02T10:55:19+0000) JAXWS-RI/2.2.6-2 JAXWS/2.2 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws/" name="EquationService">
<types>
<xsd:schema>
<xsd:import namespace="http://ws/" schemaLocation="http://localhost:8080/EquationService/EquationService?xsd=1"/>
</xsd:schema>
</types>
<message name="hello">
<part name="parameters" element="tns:hello"/>
</message>
<message name="helloResponse">
<part name="parameters" element="tns:helloResponse"/>
</message>
<message name="solveQuadratic">
<part name="parameters" element="tns:solveQuadratic"/>
</message>
<message name="solveQuadraticResponse">
<part name="parameters" element="tns:solveQuadraticResponse"/>
</message>
<portType name="EquationService">
<operation name="hello">
<input wsam:Action="http://ws/EquationService/helloRequest" message="tns:hello"/>
<output wsam:Action="http://ws/EquationService/helloResponse" message="tns:helloResponse"/>
</operation>
<operation name="solveQuadratic">
<input wsam:Action="http://ws/EquationService/solveQuadraticRequest" message="tns:solveQuadratic"/>
<output wsam:Action="http://ws/EquationService/solveQuadraticResponse" message="tns:solveQuadraticResponse"/>
</operation>
</portType>
<binding name="EquationServicePortBinding" type="tns:EquationService">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="hello">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="solveQuadratic">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="EquationService">
<port name="EquationServicePort" binding="tns:EquationServicePortBinding">
<soap:address location="http://localhost:8080/EquationService/EquationService"/>
</port>
</service>
</definitions>